# WorksharingSaveAsOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharingSaveAsOptions Class
Members See Also
---
This class contains options specific to worksharing SaveAs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class WorksharingSaveAsOptions : IDisposable
```

Visual Basic
---
```text
Public Class WorksharingSaveAsOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class WorksharingSaveAsOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..WorksharingSaveAsOptions
# See Also
WorksharingSaveAsOptions Members
Autodesk.Revit.DB Namespace